app/controllers/line_bot_controller.rb

        task = Task.new(content: message)

        if task.save
---
INSERT INTO `tasks` (`content`, `created_at`, `updated_at`) VALUES ('Task.11', '2023-07-19 05:24:46.941043', '2023-07-19 05:24:46.941043')