app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE `tasks` SET `tasks`.`content` = '10のタスク内容', `tasks`.`updated_at` = '2023-07-16 13:08:45.772194' WHERE `tasks`.`id` = 11

  def destroy
    @task.destroy!
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 1

    def set_task
      @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1